Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By default, this extension will configure the probes to use the HTTP server (which is provided by some extensions like the Quarkus REST (formerly RESTEasy Reactive) extension). Internally, this probe will also use xref:grpc-service-implementation.adoc#health[the generated gRPC Health services].
ja_jp: デフォルトでは、このエクステンションは、プローブが HTTP サーバーを使用するように設定します (Quarkus REST (旧称 RESTEasy Reactive) などの一部のエクステンションによって提供される HTTP サーバー)。内部的には、このプローブは、xref:grpc-service-implementation.adoc#health[生成される gRPC Health サービス] も使用します。

source: By default, this filter uses `OidcClient` to acquire the first pair of access and refresh tokens at initialization time. If the access tokens are short-lived and refresh tokens are unavailable, then the token acquisition should be delayed with `quarkus.oidc-client.early-tokens-acquisition=false`.
ja_jp: デフォルトでは、このフィルターは初期化時に `OidcClient` を取得して、アクセストークンとリフレッシュトークンの最初のペアを取得します。アクセストークンが短命でリフレッシュトークンが利用できない場合は、 `quarkus.oidc-client.early-tokens-acquisition=false` でトークンの取得を遅延させる必要があります。

source: By default, this filter will get `OidcClient` to acquire the first pair of access and refresh tokens at its initialization time. If the access tokens are short-lived and refresh tokens are not available then the token acquisition should be delayed with `quarkus.oidc-client.early-tokens-acquisition=false`.
ja_jp: デフォルトでは、このフィルタは初期化時に `OidcClient` を取得してアクセストークンとリフレッシュトークンの最初のペアを取得します。アクセストークンが短命でリフレッシュトークンが利用できない場合は、 `quarkus.oidc-client.early-tokens-acquisition=false` でトークンの取得を遅延させるべきです。

source: By default, this filter will get `OidcClient` to acquire the first pair of access and refresh tokens at its initialization time. If the access tokens are short-lived and refresh tokens are unavailable, then the token acquisition should be delayed with `quarkus.oidc-client.early-tokens-acquisition=false`.
ja_jp: デフォルトでは、このフィルタは初期化時に `OidcClient` を取得してアクセストークンとリフレッシュトークンの最初のペアを取得します。アクセストークンが短命でリフレッシュトークンが利用できない場合は、 `quarkus.oidc-client.early-tokens-acquisition=false` でトークンの取得を遅延させるべきです。

source: By default, transactions in cluster are disabled and transaction commands immediately fail.
ja_jp: デフォルトでは、クラスターでのトランザクションは無効になっており、トランザクションコマンドは即座に失敗します。

source: By default, we consider passwords to be stored hashed with https://en.wikipedia.org/wiki/Bcrypt[bcrypt] under the https://en.wikipedia.org/wiki/Crypt_(C)[Modular Crypt Format] (MCF).
ja_jp: デフォルトでは、パスワードは MCF ( link:https://en.wikipedia.org/wiki/Crypt_©[Modular Crypt Format]) の下で link:https://en.wikipedia.org/wiki/Bcrypt[bcrypt]でハッシュ化されて保存されると考えています。

source: By default, when `quarkus.datasource.jdbc.tracing` is true, tracing is enabled at runtime but you can explicitly disable it by setting the following property:
ja_jp: デフォルトでは、 `quarkus.datasource.jdbc.tracing` が true の場合、実行時にトレースが有効になりますが、以下のプロパティを設定することで、明示的にトレースを無効にすることができます。

source: By default, when a Quarkus application starts (in regular or dev mode), it will display an ASCII art banner. The banner can be disabled by setting `quarkus.banner.enabled=false` in `application.properties`, by setting the `-Dquarkus.banner.enabled=false` Java System Property, or by setting the `QUARKUS_BANNER_ENABLED` environment variable to `false`. Furthermore, users can supply a custom banner by placing the banner file in `src/main/resources` and configuring `quarkus.banner.path=name-of-file` in `application.properties`.
ja_jp: デフォルトでは、通常モードまたは開発モードで Quarkus アプリケーションが起動すると、 ASCII アートバナーが表示されます。バナーを無効にするには、 `application.properties` で `quarkus.banner.enabled=false` を設定するか、 `Dquarkus.banner.enabled=false` の Java システムプロパティーを設定する、 あるいは `QUARKUS_BANNER_ENABLED` 環境変数を `false` に設定します。 さらに、 `src/main/resources` にバナーファイルを配置し、 `application.properties` に `quarkus.banner.path=nam-of-file` を設定することで、ユーザーはカスタムのバナーを提供することができます。

source: By default, when a client JWT authentication token must be produced, it is generated by Quarkus OIDC. In some cases, the JWT bearer token may be provided and periodically updated by Kubernetes.
ja_jp: デフォルトでは、クライアント JWT 認証トークンを作成する必要がある場合、Quarkus OIDC によって生成されます。場合によっては、JWT ベアラートークンが Kubernetes によって提供され、定期的に更新されることもあります。

source: By default, when building a native executable, GraalVM will not include any of the resources that are on the classpath into the native executable it creates. Resources that are meant to be part of the native executable need to be configured explicitly.
ja_jp: デフォルトでは、ネイティブ実行可能ファイルをビルドする際に、GraalVM はクラスパス上にあるリソースを、作成するネイティブ実行可能ファイルには含めません。ネイティブ実行可能ファイルの一部となるリソースは、明示的に設定する必要があります。

source: By default, when no `deployment-target` is set, then only vanilla Kubernetes resources are generated and deployed. When multiple values are set (for example `quarkus.kubernetes.deployment-target=kubernetes,openshift`) then the resources for all targets are generated, but only the resources that correspond to the *first* target are applied to the cluster (if deployment is enabled).
ja_jp: デフォルトでは、 `deployment-target` が設定されていない場合は、バニラ Kubernetes リソースのみが生成され、デプロイされます。複数の値が設定されている場合 (例: `quarkus.kubernetes.deployment-target=kubernetes,openshift` )、すべてのターゲットのリソースが生成されますが、 *最初* のターゲットに対応するリソースのみがクラスターに適用されます (デプロイが有効な場合)。

source: By default, when no `quarkus.oidc.resource-metadata.resource` is configured, a protected resource metadata route is available at a `/.well-known/oauth-protected-resource` relative address.
ja_jp: デフォルトでは、 `quarkus.oidc.resource-metadata.resource` が設定されていない場合、保護されたリソースメタデータのルートは `/.well-known/oauth-protected-resource` という相対アドレスで利用可能です。

source: By default, when starting the application in dev mode, a gRPC server is started, even if no services are configured. You can configure the gRPC extension's dev mode behavior using the following properties.
ja_jp: デフォルトでは、devモードでアプリケーションを起動すると、サービスが設定されていない場合でもgRPCサーバが起動します。 gRPCエクステンションのDevモードの動作は、以下のプロパティで設定することができます。

source: By default, when the Quarkus GitHub provider acquires the access token, it sends the client id and secret as the encoded HTTP Authorization `Basic` scheme value. In some regions, GitHub may not support such an option, see the comment in the `application.properties` above how to enable a `client_secret_post` method instead, for the client id and secret be sent as form parameters.
ja_jp: デフォルトでは、Quarkus GitHub プロバイダーがアクセストークンを取得する際、クライアント ID とシークレットをエンコードされた HTTP Authorization `Basic` スキームの値として送信します。一部の地域では GitHub がこのオプションをサポートしていない場合があります。クライアント ID とシークレットをフォームパラメーターとして送信する `client_secret_post` メソッドを代わりに有効にする方法については、上記の `application.properties` 内のコメントを参照してください。

source: By default, when the classes are preloaded, they are also _initialized_, meaning it also resolves the dependent classes. You can disable this behavior using:
ja_jp: デフォルトでは、クラスがプリロードされるときに、 _初期化もされます_ 。これは、依存するクラスも解決することを意味します。この動作を無効にするには、次のようにします。

source: By default, when the document is generated, the OpenAPI version used will be `3.0.3`. If you use a static file as mentioned above, the version in the file will be used. You can also define the version in SmallRye using the following configuration:
ja_jp: デフォルトでは、ドキュメント生成時に使用されるOpenAPIのバージョンは `3.0.3` です。上記のように静的ファイルを使用する場合は、そのファイルのバージョンが使用されます。また、以下の設定でSmallRyeでバージョンを定義することもできます。

source: By default, when the document is generated, the OpenAPI version used will be `3.1.0`. If you use a static file as mentioned above, the version in the file will be used. You can also define the version in SmallRye using the following configuration:
ja_jp: デフォルトでは、ドキュメント生成時に使用される OpenAPI のバージョンは `3.1.0` です。上記のように静的ファイルを使用する場合は、そのファイルのバージョンが使用されます。また、以下の設定で SmallRye でバージョンを定義することもできます。

source: By default, you'll get a warning if a build time property has been changed at runtime. You may set the `quarkus.config.build-time-mismatch-at-runtime=fail` property to make sure your application does not start up if there is a mismatch. However, as of this writing changing `quarkus.datasource.db-kind` at runtime did neither fail nor produce a warning but was silently ignored.
ja_jp: デフォルトでは、ビルド時プロパティーがランタイムに変更された場合、警告が表示されます。 `quarkus.config.build-time-mismatch-at-runtime=fail` プロパティーを設定して、不一致があった場合にアプリケーションが起動しないようにすることもできます。 しかし、この記事を書いている時点では、ランタイムに `quarkus.datasource.db-kind` を変更しても、失敗することも警告が出ることもなく、静かに無視されました。

source: By default, you'll get a warning if a build time property has been changed at runtime. You may set the `quarkus.configuration.build-time-mismatch-at-runtime=fail` property to make sure your application does not start up if there is a mismatch. However, as of this writing changing `quarkus.datasource.db-kind` at runtime did neither fail nor produce a warning but was silently ignored.
ja_jp: デフォルトでは、ビルド時プロパティが実行時に変更された場合、警告が表示されます。 `quarkus.configuration.build-time-mismatch-at-runtime=fail` プロパティを設定して、不一致があった場合にアプリケーションが起動しないようにすることもできます。しかし、この記事を書いている時点では、実行時に `quarkus.datasource.db-kind` を変更しても、失敗することも警告が出ることもなく、静かに無視されました。

source: By default, you'll get a warning if a build time property has been changed at runtime. You may set the `quarkus.configuration.build-time-mismatch-at-runtime=fail` property to make sure your application does not startup if there is a mismatch. However, as of this writing changing `quarkus.datasource.db-kind` at runtime did neither fail nor produce a warning but was silently ignored.
ja_jp: デフォルトでは、ビルド時のプロパティが実行時に変更された場合、警告が表示されます。 `quarkus.configuration.build-time-mismatch-at-runtime=fail` プロパティを設定して、不一致があった場合にアプリケーションが起動しないようにすることもできます。しかし、この記事を書いている時点では、実行時に `quarkus.datasource.db-kind` を変更しても、失敗することも警告が出ることもなく、静かに無視されました。

source: By defaut, Quarkus OIDC stores all three tokens in an encrypted session cookie, making Quarkus OIDC stateless. Quarkus OIDC also provides the stateful xref:security-oidc-code-flow-authentication.adoc#db-token-state-manager[Database TokenStateManager] to store tokens in your database of choice and the xref:security-oidc-code-flow-authentication.adoc#redis-token-state-manager[Redis TokenStateManager] to store them in the Redis cache. Users can also register custom `io.quarkus.oidc.TokenStateManager` to store these tokens as required.
ja_jp: デフォルトでは、Quarkus OIDC は 3 つのトークンすべてを暗号化されたセッション Cookie に保存し、Quarkus OIDC をステートレスにします。また、Quarkus OIDC は、任意のデータベースにトークンを保存するためのステートフルな xref:security-oidc-code-flow-authentication.adoc#db-token-state-manager[Database TokenStateManager] や、Redis キャッシュに保存するための xref:security-oidc-code-flow-authentication.adoc#redis-token-state-manager[Redis TokenStateManager] も提供しています。必要に応じて、カスタムの `io.quarkus.oidc.TokenStateManager` を登録してこれらのトークンを保存することもできます。

source: By eliminating reliance on reflection during deserialization, applications can achieve better performance and reduced memory consumption, particularly for native applications where reflection can introduce overhead. If you implement this feature, run tests to assess its effect on your applications.
ja_jp: デシリアライズ中のリフレクションへの依存を排除することで、アプリケーションは、特にリフレクションがオーバーヘッドをもたらす可能性のあるネイティブ・アプリケーションにおいて、より良いパフォーマンスとメモリ消費の削減を達成することができます。この機能を実装する場合は、テストを実行してアプリケーションへの影響を評価してください。

source: By enabling https://netty.io/wiki/reference-counted-objects.html#leak-detection-levels[leak detection], as documented by Netty. Example:
ja_jp: Netty で文書化されているように、 https://netty.io/wiki/reference-counted-objects.html#leak-detection-levels[リーク検出] を有効にすることで。例:

source: By externalizing authorization decisions, you can:
ja_jp: 認可決定を外部化することで、次のことが可能になります。

source: By externalizing authorization from your application, you are allowed to protect your applications using different access control mechanisms as well as avoid re-deploying your application every time your security requirements change, where Keycloak will be acting as a centralized authorization service from where your protected resources and their associated permissions are managed.
ja_jp: アプリケーションから認証を外部化することで、異なるアクセス制御メカニズムを使用してアプリケーションを保護することができ、セキュリティー要件が変更されるたびにアプリケーションを再デプロイする必要がなくなります。Keycloakは、保護されたリソースおよび関連する権限が管理される一元化された認可サービスとして機能します。

source: By far the easiest way to create a container-image from your Quarkus application is to leverage one of the container-image extensions.
ja_jp: Quarkusアプリケーションからコンテナーイメージを作成する最も簡単な方法は、コンテナーイメージ エクステンションの1つを利用することです。

source: By giving a lower order to the second route, it gets evaluated first. If the request path matches, it is invoked, otherwise the other routes are evaluated.
ja_jp: 2 番目のルートに低い順序を与えることで、それが最初に評価されます。リクエストパスが一致する場合は呼び出され、一致しない場合は他のルートが評価されます。

source: By hosting an extension under the Quarkiverse Hub, the following features are enabled:
ja_jp: Quarkiverse Hubの下でエクステンションをホスティングすることで、以下の機能が有効になります:

source: By implementing `io.quarkus.load.shedding.RequestClassifier`, the application can classify requests into cohorts which are rejected independently.
ja_jp: `io.quarkus.load.shedding.RequestClassifier` を実装することで、アプリケーションはリクエストを独立して拒否されるコホートに分類できます。

source: By implementing `io.quarkus.load.shedding.RequestPrioritizer`, the application can decide which requests can be rejected early on and which requests can only be rejected when there's no other choice.
ja_jp: `io.quarkus.load.shedding.RequestPrioritizer` を実装することで、アプリケーションはどのリクエストを早期に拒否できるか、そしてどのリクエストを他に選択肢がない場合にのみ拒否できるかを決定できます。

source: By implementing `io.smallrye.config.ConfigSourceFactory`, a list of `ConfigSource` may be provided via the `Iterable<ConfigSource> getConfigSources(ConfigSourceContext context)` method. The `ConfigSourceFactory` may also assign a priority by overriding the method `OptionalInt getPriority()`. The priority values is used to sort multiple `io.smallrye.config.ConfigSourceFactory` (if found).
ja_jp: `io.smallrye.config.ConfigSourceFactory` を実装することで、 `Iterable&amp;lt;ConfigSource> getConfigSources(ConfigSourceContext context)` メソッドを介して `ConfigSource` のリストを提供することができます。また、 `ConfigSourceFactory` は、 `OptionalInt getPriority()` メソッドをオーバーライドすることで、優先度を割り当てることができます。優先度の値は、複数の `io.smallrye.config.ConfigSourceFactory` をソートするために使用されます（見つかった場合）。

source: By injecting a <<simple-build-items,simple build item>>
ja_jp: <<simple-build-items,simple build item>> を注入することで

source: By injecting a `BuildProducer` of a simple or multi build item class
ja_jp: 単純または複数のビルドアイテムクラスの `BuildProducer` を挿入する

source: By injecting a `List` of a <<multi-build-items,multi build item>> class
ja_jp: <<multi-build-items,multi build item>> クラスの `List` をインジェクションすることで、以下のようになります。

source: By injecting a `List` of a xref:multi-build-items[multi build item] class
ja_jp: xref:multi-build-items[マルチビルドアイテムクラス]の `List` を注入すること

source: By injecting a xref:simple-build-items[simple build item]
ja_jp: xref:simple-build-items[シンプルビルドアイテム] を注入すること

source: By injecting an `Optional` of a simple build item class
ja_jp: シンプルビルドアイテムクラスの `Optional` を注入すること

source: By itself this will not disable the tcp socket which by default will open on `0.0.0.0:8080`. It can be explicitly disabled:
ja_jp: これだけでは、デフォルトで `0.0.0.0:8080` で開かれる tcp ソケットを無効にすることはできません。これは次のように明示的に無効にすることができます。

source: By leveraging Quarkus, you can focus on delivering intelligent, cutting-edge applications while ensuring they remain secure, reliable, and compliant with industry standards.
ja_jp: Quarkus を活用することで、安全性、信頼性、業界標準への準拠を維持しながら、インテリジェントで最先端のアプリケーションの提供に集中できます。

source: By making the class a managed bean, Quarkus will take the customizer into account when it starts the Vert.x servers
ja_jp: クラスをマネージドBeanにすることで、QuarkusはVert.xサーバーの起動時にカスタマイザーを考慮します。

source: By nominating the central login endpoint as a callback URL, you have the authenticated users landing on this login endpoint once the authorization code flow is complete without requiring Quarkus OIDC to keep the original request URL as the authorization code flow state to be able to restore it, and also making it possible to secure the callback endpoints with the security annotations.
ja_jp: 中央のログインエンドポイントをコールバック URL として指定することで、認可コードフローの完了後に認証済みユーザーをこのログインエンドポイントに着地させることができます。これにより、Quarkus OIDC が復元のために元のリクエスト URL を認可コードフローの状態として保持する必要がなくなり、コールバックエンドポイントをセキュリティーアノテーションで保護することも可能になります。

source: By placing `@ClientQueryParam` on the interface, we ensure that `my-param` will be added to all requests of the client. Because we used the `${...}` syntax, the actual value of the parameter will be obtained using the `my.property-value` configuration property.
ja_jp: `@ClientQueryParam` をインターフェイスに配置することで、クライアントのすべてのリクエストに `my-param` が追加されるようにします。 `${...}` 構文を使用したため、パラメーターの実際の値は `my.property-value` 設定プロパティを使用して取得されます。

source: By providing CDI beans that implement `io.quarkus.micrometer.runtime.HttpClientMetricsTagsContributor`, user code can contribute arbitrary tags based on the details of HTTP request
ja_jp: `io.quarkus.micrometer.runtime.HttpClientMetricsTagsContributor` を実装する CDI Bean を提供することで、ユーザーコードは HTTP リクエストとレスポンスの詳細に基づいて任意のタグを提供できます。

source: By providing CDI beans that implement `io.quarkus.micrometer.runtime.HttpServerMetricsTagsContributor`, user code can contribute arbitrary tags based on the details of HTTP request and responses.
ja_jp: `io.quarkus.micrometer.runtime.HttpServerMetricsTagsContributor` を実装する CDI Bean を提供することで、ユーザーコードは HTTP リクエストとレスポンスの詳細に基づいて任意のタグを提供できます。

source: By providing CDI beans that implement `io.quarkus.micrometer.runtime.MeterRegistryCustomizer` user code has the change to change the configuration of any `MeterRegistry` that has been activated. Unless an implementation is annotated with `@io.quarkus.micrometer.runtime.MeterRegistryCustomizerConstraint`, the customization applies to all `MeterRegistry` instances.
ja_jp: `io.quarkus.micrometer.runtime.MeterRegistryCustomizer` を実装する CDI Bean を提供することで、ユーザーコードはアクティブ化された任意の `MeterRegistry` の設定を変更できます。 実装に `@io.quarkus.micrometer.runtime.MeterRegistryCustomizerConstraint` アノテーションが付与されていない限り、このカスタマイズはすべての `MeterRegistry` インスタンスに適用されます。

source: By providing a cache configuration, this cache will be present on the server container
ja_jp: キャッシュ設定を指定することで、このキャッシュがサーバー・コンテナ上に存在することになります。

source: By providing the `admin:admin` credentials, the extension authenticated the user and loaded their roles. The `admin` user is authorized to access to the protected resources.
ja_jp: `admin:admin` 資格情報を提供することで、エクステンションはユーザーを認証し、そのロールをロードしました。 `admin` ユーザーは、保護されたリソースへのアクセスを許可されています。

source: By providing the `admin:password` credentials, the extension authenticated the user and loaded their roles. The `admin` user is authorized to access to the protected resources.
ja_jp: `admin:password` クレデンシャルを提供することで、エクステンションはユーザーを認証し、そのロールをロードします。 `admin` ユーザは保護されたリソースへのアクセスが許可されます。

source: By providing the `adminUser:adminUserPassword` credentials, the extension authenticated the user and loaded their roles. The `adminUser` user is authorized to access to the protected resources.
ja_jp: `adminUser:adminUserPassword` 資格情報を提供することで、エクステンションはユーザーを認証し、そのロールをロードしました。 `adminUser` ユーザーは、保護されたリソースへのアクセスを許可されています。

source: By returning a <<simple-build-items,simple build item>> or <<multi-build-items,multi build item>> instance
ja_jp: <<simple-build-items,simple build item>> または <<multi-build-items,multi build item>> のインスタンスを返すことで

source: By returning a `List` of a multi build item class
ja_jp: マルチビルドアイテムクラスの `List` を返す

source: By setting the `quarkus.tls.key-store.pem.acme.cert` and `quarkus.tls.key-store.pem.acme.key` variables or their environment variable variant, the TLS registry will use the certificate and private key from the secret.
ja_jp: `quarkus.tls.key-store.pem.acme.cert` および `quarkus.tls.key-store.pem.acme.key` 変数またはその環境変数バリアントを設定すると、TLS レジストリーがシークレットからの証明書と秘密鍵を使用します。

source: By setting the `reload-period` property, the TLS registry will periodically check the keystores and truststores for changes and reload them if needed:
ja_jp: `reload-period` プロパティーを設定すると、TLS レジストリーはキーストアとトラストストアの変更を定期的にチェックし、必要に応じて再読み込みします。

source: By simply annotating any test in the test suite with `@QuarkusTestResource`, Quarkus will run the corresponding `QuarkusTestResourceLifecycleManager` before any tests are run. A test suite is also free to utilize multiple `@QuarkusTestResource` annotations, in which case all the corresponding `QuarkusTestResourceLifecycleManager` objects will be run before the tests.
ja_jp: テストスイート内の任意のテストに `@QuarkusTestResource` というアノテーションを付けるだけで、Quarkus はテストが実行される前に、対応する `QuarkusTestResourceLifecycleManager` を実行します。 テストスイートでは、複数の `@QuarkusTestResource` アノテーションを自由に利用することもできます。その場合、対応するすべての `QuarkusTestResourceLifecycleManager` オブジェクトがテストの前に実行されます。

source: By simply annotating any test in the test suite with `@QuarkusTestResource`, Quarkus will run the corresponding `QuarkusTestResourceLifecycleManager` before any tests are run. A test suite is also free to utilize multiple `@QuarkusTestResource` annotations, in which case all the corresponding `QuarkusTestResourceLifecycleManager` objects will be run before the tests. When using multiple test resources they can be started concurrently. For that you need to set `@QuarkusTestResource(parallel = true)`.
ja_jp: テストスイート内のテストに `@QuarkusTestResource` のアノテーションを付けるだけで、Quarkus は、テストが実行される前に対応する `QuarkusTestResourceLifecycleManager` を実行します。テストスイートは、複数の `@QuarkusTestResource` アノテーションを自由に利用することもできます。この場合、対応するすべての `QuarkusTestResourceLifecycleManager` オブジェクトがテストの前に実行されます。複数のテストリソースを使用する場合、それらを同時に開始できます。そのためには、 `@QuarkusTestResource(parallel = true)` を設定する必要があります。

source: By the way you can see that Quarkus is pretty well https://quarkus.io/guides/[documented,role=external,window=_blank].
ja_jp: ちなみにQuarkusはかなり https://quarkus.io/guides/[ガイド, role=external, window=_blank]が充実しているのがわかるかと思います。

source: By the way, if you like, you can run the tests in Continuous mode directly from DevUI:
ja_jp: ちなみに、必要に応じて DevUI から直接、連続モードでテストを実行することもできます。

source: By using <<oidc-session,OidcSession>>, you can support a local logout, which means that only the local session cookie is cleared, as shown in the following example:
ja_jp: <<oidc-session,OidcSession>> を使用することで、ローカルログアウトをサポートできます。つまり、次の例に示すように、ローカルセッションクッキーのみがクリアされます。

source: By using a Bson `Codec`, the MongoDB Client will take care of the transformation of your domain object to/from a MongoDB `Document` automatically.
ja_jp: Bson `Codec` を使用することで、MongoDB クライアントは自動的に MongoDB `Document` への/からのドメインオブジェクトの変換の世話をします。

source: By using environment variables or configuration files, set up the keystore with the paths to the certificate and private key. This example uses environment variables. OpenShift serving certificates always create the `tls.crt` and `tls.key` files.
ja_jp: 環境変数または設定ファイルを使用して、証明書と秘密鍵へのパスを含むキーストアをセットアップします。この例では環境変数を使用します。OpenShift 提供証明書は常に `tls.crt` ファイルと `tls.key` ファイルを作成します。

source: By using the `@DefaultValue` annotation we have determined that the surname value will be `Skywalker` when the parameter is not provided.
ja_jp: `@DefaultValue` のアノテーションを使用して、パラメータが提供されていない場合、姓の値は `Skywalker` になることを決定しました。

source: By using the `@Observer` you can add anything to the Schema builder.
ja_jp: `@Observer` を使用することで、スキーマビルダーに何かを追加することができます。

source: By using the `QuarkusTest` runner, you instruct JUnit to start the application before the tests.
ja_jp: `QuarkusTest` ランナーを使用し、テストの前にアプリケーションを起動するように JUnit に指示します。

source: By using the `apiVersion` and `kind` properties of the Operator resource, which matches the used `postgresql` Operator, the generated `ServiceBinding` resource binds the service or resource to the application.
ja_jp: 使用された `postgresql`` Operator と一致する Operator リソースの `apiVersion` プロパティーと `kind` プロパティーを使用することにより、生成された `ServiceBinding` リソースは、サービスまたはリソースをアプリケーションにバインドします。
